In [1]:
import pandas as pd

In [3]:
data={}
data={
    'apples':[3,2,0,1],
    'oranges':[0,3,7,2]
}

In [4]:
purchases=pd.DataFrame(data)
print(purchases)

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [6]:
purchases=pd.DataFrame(data,index=['Nic','Joel','Tim','John'])
print(purchases)

      apples  oranges
Nic        3        0
Joel       2        3
Tim        0        7
John       1        2

In [7]:
purchases.loc['Tim']

apples     0
oranges    7
Name: Tim, dtype: int64

In [12]:
df=pd.read_csv (r'C:\Users\HP\Python-Class-Advanced\Pandas_Exercise\employee_file.csv')
print(df)

     John Smith Accounting November
0  Erica Meyers         IT    March

In [13]:
df=pd.read_csv (r'C:\Users\HP\Python-Class-Advanced\Pandas_Exercise\employee_file.csv', index_col=0)
print(df)

             Accounting November
John Smith
Erica Meyers         IT    March

In [14]:
df = pd.read_json(r'C:\Users\HP\Python-Class-Advanced\Pandas_Exercise\contacts.json')
print(df)

                                       1                2               3
First Name                      Nicholas            Dolly            Tina
Middle Name                            O                K               O
Last Name                         Okello            Omosh            Tina
Mailing Address                    Box 1            Box 2           Box 3
City                             Nairobi           Nakuru         Kericho
Country                            Kenya            Kenya           Kenya
Zip Code                             254              254             254
Email Address    nokello2002@yahoo.co.uk  dolly@gmail.com  tina@gmail.com
Phone Number                  0711112233       0721113223      0744232323

In [17]:
df.shape

(9, 3)

In [18]:
df.info

<bound method DataFrame.info of                                        1                2               3
First Name                      Nicholas            Dolly            Tina
Middle Name                            O                K               O
Last Name                         Okello            Omosh            Tina
Mailing Address                    Box 1            Box 2           Box 3
City                             Nairobi           Nakuru         Kericho
Country                            Kenya            Kenya           Kenya
Zip Code                             254              254             254
Email Address    nokello2002@yahoo.co.uk  dolly@gmail.com  tina@gmail.com
Phone Number                  0711112233       0721113223      0744232323>

In [19]:
temp_df=df.append(df)
print(temp_df)

                                       1                2               3
First Name                      Nicholas            Dolly            Tina
Middle Name                            O                K               O
Last Name                         Okello            Omosh            Tina
Mailing Address                    Box 1            Box 2           Box 3
City                             Nairobi           Nakuru         Kericho
Country                            Kenya            Kenya           Kenya
Zip Code                             254              254             254
Email Address    nokello2002@yahoo.co.uk  dolly@gmail.com  tina@gmail.com
Phone Number                  0711112233       0721113223      0744232323
First Name                      Nicholas            Dolly            Tina
Middle Name                            O                K               O
Last Name                         Okello            Omosh            Tina
Mailing Address                    Box 1            Box 2           Box 3
City                             Nairobi           Nakuru         Kericho
Country                            Kenya            Kenya           Kenya
Zip Code                             254              254             254
Email Address    nokello2002@yahoo.co.uk  dolly@gmail.com  tina@gmail.com
Phone Number                  0711112233       0721113223      0744232323

In [20]:
temp_df.shape

(18, 3)

In [21]:
temp_df= temp_df.drop_duplicates()
temp_df.shape

(9, 3)

In [24]:
temp_df=df.append(df)    #create copies

temp_df= temp_df.drop_duplicates(inplace=True, keep=False)

In [25]:
df.columns

Int64Index([1, 2, 3], dtype='int64')

In [26]:
df.isnull()

                     1      2      3
First Name       False  False  False
Middle Name      False  False  False
Last Name        False  False  False
Mailing Address  False  False  False
City             False  False  False
Country          False  False  False
Zip Code         False  False  False
Email Address    False  False  False
Phone Number     False  False  False

In [27]:
df.isnull().sum()

1    0
2    0
3    0
dtype: int64

In [28]:
df.head()

                        1       2        3
First Name       Nicholas   Dolly     Tina
Middle Name             O       K        O
Last Name          Okello   Omosh     Tina
Mailing Address     Box 1   Box 2    Box 3
City              Nairobi  Nakuru  Kericho

In [29]:
df.describe()

               1      2     3
count          9      9     9
unique         9      9     8
top     Nicholas  Kenya  Tina
freq           1      1     2